mattehicks/SCDE/components/ESP32_BH1750_Module/ESP32_BH1750_Module.c
/*
  // set start of possible def-Name
  const uint8_t *defName = args;

  // set start of possible attr-Name
  const uint8_t *attrName = args;

  // a seek-counter

  int i = 0;

  // seek to next space !'\32'
  while( (i < argsLen) && (*attrName != ' ') ) {i++;attrName++;}

  // length of def-Name
  size_t defNameLen = i;

  // seek to start position of attr-Name '\32'
  while( (i < argsLen) && (*attrName == ' ') ) {i++;attrName++;}

  // set start of possible attr-Val
  const uint8_t *attrVal = attrName;

  // a 2nd seek-counter
  int j = 0;

  // seek to next space !'\32'
  while( (i < argsLen) && (*attrVal != ' ') ) {i++,j++;attrVal++;}

  // length of attr-Name
  size_t attrNameLen = j;

  // start position of attr-Val
  while( (i < argsLen) && (*attrVal == ' ') ) {i++;attrVal++;}


  // length of attr-Val
  size_t attrValLen = argsLen - i;

  // veryfy lengths > 0, definition 0 allowed
  if ( (defNameLen == 0) || (attrNameLen == 0) )

		{

		// response with error text
		asprintf(&retMsg
				,"Could not interpret command ''! Usage: Attr <defname> <attrname> [<attrval>]");

		return retMsg;

	//	}

// -------------------------------------------------------------------------------------------------
*/

  return retMsg;
}



/**
 * -------------------------------------------------------------------------------------------------
 *  FName: ESP32_BH1750_Define
 *  Desc: Finalizes the defines a new "device" of 'ESP32_S0' type. Contains devicespecific init code.
 *  Info: 
 *  Para: Common_Definition_t *Common_Definition -> prefilled ESP32Control Definition
 *        char *Definition -> the last part of the CommandDefine arg* 
 *  Rets: strTextMultiple_t* -> response text NULL=no text
 * -------------------------------------------------------------------------------------------------
 */
strTextMultiple_t* ICACHE_FLASH_ATTR 
ESP32_BH1750_Define(Common_Definition_t *Common_Definition)
{

  // for Fn response msg
  strTextMultiple_t *retMsg = NULL;

  // make common ptr to modul specific ptr
  ESP32_BH1750_Definition_t* ESP32_BH1750_Definition =
		  (ESP32_BH1750_Definition_t*) Common_Definition;

// -------------------------------------------------------------------------------------------------

  #if ESP32_BH1750_Module_DBG >= 5
  SCDEFn->Log3Fn(Common_Definition->name
	,Common_Definition->nameLen
	,5
	,"DefineFn of Module '%.*s' is called to continue creation of Definition '%.*s' with args '%.*s'."
	,ESP32_BH1750_Definition->common.module->ProvidedByModule->typeNameLen
	,ESP32_BH1750_Definition->common.module->ProvidedByModule->typeName
	,ESP32_BH1750_Definition->common.nameLen
	,ESP32_BH1750_Definition->common.name
	,ESP32_BH1750_Definition->common.definitionLen
	,ESP32_BH1750_Definition->common.definition);
  #endif

// ------------------------------------------------------------------------------------------------

  // new conversation
  uint8_t *defArgsText = Common_Definition->definition;
  size_t defArgsTextLen = Common_Definition->definitionLen;

  // Check for args. This type requires args...
  if (!defArgsTextLen) {

	// alloc mem for retMsg
	retMsg = malloc(sizeof(strTextMultiple_t));

	// response with error text
	retMsg->strTextLen = asprintf(&retMsg->strText
		,"Parsing Error! Expected Args!");

	return retMsg;
  }

// ------------------------------------------------------------------------------------------------

  // store FD to Definition. Will than be processed in global loop ... -> THIS MODULE USES NO FD
  ESP32_BH1750_Definition->common.fd = -1;

// ------------------------------------------------------------------------------------------------

  // init WebIf_Provided offset
//  ESP32Control_Definition->common.link =
//	&ESP32Control_Definition->WebIf_Provided;

  // check for loaded Module 'WebIf' -> get provided Fn
  ESP32_BH1750_Definition->WebIf_Provided.WebIf_FnProvided =
	NULL;//(WebIf_FnProvided_t *) SCDEFn->GetFnProvidedByModule("WebIf");

 // Providing data for WebIf? Initialise data provided for WebIf
  if (ESP32_BH1750_Definition->WebIf_Provided.WebIf_FnProvided) {

	ESP32_BH1750_Definition->WebIf_Provided.ActiveResourcesDataA =
		(WebIf_ActiveResourcesDataA_t *) &ESP32_BH1750_ActiveResourcesDataA_forWebIf;

	ESP32_BH1750_Definition->WebIf_Provided.ActiveResourcesDataB =
		(WebIf_ActiveResourcesDataB_t *) &ESP32_BH1750_ActiveResourcesDataB_forWebIf;

	}

  else	{

	SCDEFn->Log3Fn(Common_Definition->name
		,Common_Definition->nameLen
		,1
		,"Could not enable WebIf support for '%.*s'. Type '%.*s' detects Type 'WebIf' is NOT loaded!"
		,ESP32_BH1750_Definition->common.nameLen
		,ESP32_BH1750_Definition->common.name
		,ESP32_BH1750_Definition->common.module->ProvidedByModule->typeNameLen
		,ESP32_BH1750_Definition->common.module->ProvidedByModule->typeName);
	}

// ------------------------------------------------------------------------------------------------

  // Parse define-args (KEY=VALUE) protocol -> gets parsedKVInput in allocated mem, NULL = ERROR
  parsedKVInputArgs_t *parsedKVInput = 
    SCDEFn->ParseKVInputArgsFn(ESP32_BH1750_SET_IK_Number_of_keys	// Num Implementated KEYs MAX
    ,ESP32_BH1750_Set_ImplementedKeys					// Implementated Keys
    ,defArgsText							// our args text
    ,defArgsTextLen);							// our args text len

  // parsing may report an problem. args contain: unknown keys, double keys, ...?
  if (!parsedKVInput) {

    // alloc mem for retMsg
    retMsg = malloc(sizeof(strTextMultiple_t));

    // response with error text
    retMsg->strTextLen = asprintf(&retMsg->strText
      ,"Parsing Error! Args '%.*s' not taken! Check the KEYs!"
      ,defArgsTextLen
      ,defArgsText);

    if (parsedKVInput) {

      free(parsedKVInput);

    }

    return retMsg;

  }

// ------------------------------------------------------------------------------------------------






// ------------------------------------------------------------------------------------------------

  // set required Keys -> Keys that should be there in this request
  parsedKVInput->requiredKVBF = ( (1 << ESP32_BH1750_SET_GPIO)
			        | (1 << ESP32_BH1750_SET_BLOCK)
			        | (1 << ESP32_BH1750_SET_CHANNEL)
			        | (1 << ESP32_BH1750_SET_TIMER)
			        | (1 << ESP32_BH1750_SET_DUTY)
			        | (1 << ESP32_BH1750_SET_HPOINT)
			        | (1 << ESP32_BH1750_SET_SIG_OUT_EN)
			        | (1 << ESP32_BH1750_SET_IDLE_LV)
			        | (1 << ESP32_BH1750_SET_RESOLUTION)
			        | (1 << ESP32_BH1750_SET_TICK_SOURCE)
			        | (1 << ESP32_BH1750_SET_FREQ_HZ) );

